In [3]:
import pandas as pd

### Download the data and load it to Pandas. 

You can find them [here](https://drive.google.com/file/d/1NY6cmF9Shjw-dD7BD6bNmfcIVz-kQcFR/view?usp=sharing).

In [4]:
titles = pd.read_csv('titles.csv', index_col=None)
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [5]:
cast = pd.read_csv('cast.csv', index_col=None)
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### What are the ten most common movie names of all time?

In [9]:
titles['title'].value_counts().head(10)

Hamlet                  18
Carmen                  16
Macbeth                 15
Maya                    12
The Outsider            12
The Three Musketeers    11
Temptation              11
Kismet                  11
Freedom                 11
Othello                 11
Name: title, dtype: int64

### Which three years in the 1930s saw the most films released?

In [10]:
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [13]:
the_filter = (titles['year']>=1930) & (titles['year']<=1939)

In [38]:
titles[the_filter].groupby('year').agg({'title':'count'}).sort_values('title',ascending=False).head(3)

      title
year
1937   1196
1936   1138
1938   1129

### Count the number of films that have been released in each decade over the history of cinema.

In [20]:
from math import ceil

In [26]:
titles['decade'] =(titles['year'] // 10)*10

In [27]:
titles

                                       title  year  decade
0                             The Rising Son  1990    1990
1                    The Thousand Plane Raid  1969    1960
2                           Crucea de piatra  1993    1990
3                                    Country  2000    2000
4                                 Gaiking II  2011    2010
...                                      ...   ...     ...
232325                                 E yue  2005    2000
232326                          Lakota Girls  2015    2010
232327                        Kroniki domowe  1997    1990
232328                  Awakening the Zodiac  2017    2010
232329  Death in the Valley of Good and Evil  2018    2010

[232330 rows x 3 columns]

In [31]:
titles.groupby('decade').agg({'title':'count'})

        title
decade
1890        3
1900       37
1910     6512
1920     8797
1930    10097
1940     8576
1950    12711
1960    17515
1970    18714
1980    20243
1990    22225
2000    38713
2010    67977
2020      210

### Count the number of "Hamlet" films made in each decade.

In [41]:
hamlet_df = titles[titles['title']=='Hamlet']
hamlet_df

         title  year  decade
6009    Hamlet  1948    1940
45350   Hamlet  1990    1990
46721   Hamlet  1910    1910
92146   Hamlet  1976    1970
94355   Hamlet  1987    1980
94554   Hamlet  2000    2000
98554   Hamlet  1921    1920
102919  Hamlet  2011    2010
122704  Hamlet  1969    1960
128388  Hamlet  1954    1950
166410  Hamlet  1913    1910
168965  Hamlet  2015    2010
176069  Hamlet  2009    2000
182970  Hamlet  1964    1960
201291  Hamlet  1996    1990
209878  Hamlet  1911    1910
221479  Hamlet  1973    1970
223568  Hamlet  2014    2010

In [45]:
hamlet_df.groupby('decade').agg({'title':'count'}).sort_values('title', ascending=False)

        title
decade
1910        3
2010        3
1960        2
1970        2
1990        2
2000        2
1920        1
1940        1
1950        1
1980        1

### Count the number of "Rustler" characters in each decade of the history of film.

In [46]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [47]:
cast['decade'] = (cast['year'] // 10)*10

In [48]:
cast.head()

,title,year,name,type,character,n,decade
0,Closet Monster,2015,Buffy #1,actor,Buffy 4,NaN,2010
1,Suuri illusioni,1985,Homo $,actor,Guests,22.0,1980
2,Battle of the Sexes,2017,$hutter,actor,Bobby Riggs Fan,10.0,2010
3,Secret in Their Eyes,2015,$hutter,actor,2002 Dodger Fan,NaN,2010
4,Steve Jobs,2015,$hutter,actor,1988 Opera House Patron,NaN,2010

In [50]:
rustler_df = cast[cast['character']=='Rustler']
rustler_df.head()

                   title  year            name   type character   n  decade
13041       Pinto Canyon  1940  Victor Adamson  actor   Rustler NaN    1940
13172  Two Gun Troubador  1939  Victor Adamson  actor   Rustler NaN    1930
43766     The Last Stand  1938     Gene Alsace  actor   Rustler NaN    1930
75824             Wanted  1967      Bruno Ari?  actor   Rustler NaN    1960
93905      Silent Valley  1935    Jimmy Aubrey  actor   Rustler NaN    1930

In [52]:
rustler_df.groupby('decade').agg({'character':'count'})

        character
decade
1920            6
1930           84
1940           18
1950            8
1960            2
1970            9
1980            1
1990            4
2000            2

### Count the number of "Hamlet" characters in each decade.

### What are the 11 most common character names in movie history?

In [59]:
cast.groupby('character').agg({'title':'count'}).sort_values(by='title', ascending=False).head(11)

             title
character
Himself      19600
Dancer       12096
Extra        10953
Reporter      8154
Doctor        7436
Student       7177
Policeman     6883
Party Guest   6742
Nurse         6676
Bartender     6613
Minor Role    6255

### Who are the 10 people most often credited as "Herself" in film history?

In [62]:
herself = cast[cast['character']=='Herself']
herself.head()

,title,year,name,type,character,n,decade
115019,Alexander Jamieson,2016,Etta Baker,actor,Herself,NaN,2010
193330,Le fils de Gascogne,1995,Ren? Biaggi,actor,Herself,22.0,1990
205993,Forty Shades of Blue,2005,J. Blackfoot,actor,Herself,7.0,2000
206325,Wienfilm 1896-1976,1976,Moucle Blackout,actor,Herself,NaN,1970
224203,Not Another B Movie,2010,Babette Bombshell,actor,Herself,19.0,2010

In [65]:
herself.groupby('name').agg({'title':'count'}).sort_values(by='title',ascending=False).head(10)

                    title
name
Queen Elizabeth II     11
Joyce Brothers          9
Margaret Thatcher       8
Hillary Clinton         7
Mary Jo Pehl            7
Joan Rivers             6
Sumie Sakai             6
Bunny Yeager            5
Kareena Kapoor          5
Rekha                   5

### Who are the 10 people most often credited as "Himself" in film history?

### Which actors or actresses appeared in the most movies in the year 1945?

In [106]:
df_1945 = cast[cast['year']==1945]

In [118]:
cast[cast['year']==1945].groupby('name').count().sort_values(by='title', ascending=False).head(1)

              title  year  type  character   n  decade
name
Emmett Vogan     39    39    39         39  14      39

In [122]:
year_filt = cast['year'] == 1945
cast[year_filt].groupby('name').agg(n_movies = ('name', 'count')).nlargest(1, 'n_movies')

              n_movies
name
Emmett Vogan        39

### Which actors or actresses appeared in the most movies in the year 1985?

### How many roles "Mammootty" has played in each year of his career.

### What are the 10 most frequent roles that start with the phrase "Patron in"?

### What are the 10 most frequent roles that start with the word "Science"?

### Count number of n-values of the roles that Judi Dench has played over her career.

In [90]:
cast[cast['name'] == 'Judi Dench']['n'].count()

48

### Count number of n-values of Cary Grant's roles through his career.

### Count number of n-value of the roles that Sidney Poitier has acted over the years.

### How many leading (n=1) roles were available to actors, and how many to actresses, in the 1950s?

### How many supporting (n=2) roles were available to actors, and how many to actresses, in the 1950s?

In [66]:
cast.head()

,title,year,name,type,character,n,decade
0,Closet Monster,2015,Buffy #1,actor,Buffy 4,NaN,2010
1,Suuri illusioni,1985,Homo $,actor,Guests,22.0,1980
2,Battle of the Sexes,2017,$hutter,actor,Bobby Riggs Fan,10.0,2010
3,Secret in Their Eyes,2015,$hutter,actor,2002 Dodger Fan,NaN,2010
4,Steve Jobs,2015,$hutter,actor,1988 Opera House Patron,NaN,2010

In [99]:
filter_df = cast[(cast['n'] == 2) & ((n_2['type'] == 'actor') | (n_2['type'] == 'actress')) & (cast['decade'] == 1950)]

In [100]:
filter_df

,title,year,name,type,character,n,decade
1128,Bashi-Achuki,1956,Dodo Abashidze,actor,Abdoushahili,2.0,1950
2149,The Invisible Boy,1957,Philip Abbott,actor,Dr. Tom Merrinoe,2.0,1950
7119,A los cuatro vientos,1955,Miguel Aceves Mej?a,actor,Pablo G?lvez,2.0,1950
7124,Cuatro copas,1958,Miguel Aceves Mej?a,actor,Miguel,2.0,1950
9948,Private's Progress,1956,Ronald Adam,actor,Doctor at Medical,2.0,1950
...,...,...,...,...,...,...,...
3631897,"Karagiozis, o adikimenos tis zois",1959,Voula Zouboulaki,actress,Marika,2.0,1950
3631898,Mono gia mia nyhta,1958,Voula Zouboulaki,actress,Anna,2.0,1950
3632044,El honorable inquilino,1951,Olga Zubarry,actress,Ana Mar?a,2.0,1950
3633374,El puma,1959,Sof?a ?lvarez,actress,Norte?a,2.0,1950
3634392,Akdeniz korsanlari,1950,Muazzez ?lkerer,actress,Maria,2.0,1950

In [101]:
filter_df.groupby('type').agg({'n':'count'})

            n
type
actor    4564
actress  4556

In [102]:
cast[(cast['n'] == 2) & ((n_2['type'] == 'actor') | (n_2['type'] == 'actress')) & (cast['decade'] == 1950)].groupby('type').agg({'n':'count'})

            n
type
actor    4564
actress  4556